[prolog.pl].
?- append([a,b,c], [], R).
?- append([a,b,c], X, [a,b,c,d,e]).
?- append(Y, X, [a,b,c,d,e]).
?- parent(julia, X), parent(X, Y).
?- test(a).
?- test(a)
?- test(a,[a).
?- test(a,[a,]).
?- test(a,[a|]).
?- test(a,a|).
[prolog.pl].
?- append([a,b,c], X, [a,b,c,d,e]).
?- append(Y, X, [a,b,c,d,e]).
?- test(a).
?- test(a)
?- test(a,[a).
?- test(a,[a|]).
?- test(a,a|b).
?- append([a,b,c], X, [a,b,c,d,e]).
[prolog.pl].
?- append([a,b,c], X, [a,b,c,d,e]).
?- append(Y, X, [a,b,c,d,e]).
